Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/supplementary_welfare_allowance_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Overview of the Supplementary Welfare Allowance Scheme
ga: Forbhreathnú ar an Scéim Liúntas Forlíontach Leasa Shóisialaigh

source: The Supplementary Welfare Allowance Scheme consists of a basic payment, called Supplementary Welfare Allowance, and other financial supplements for certain expenses you may not be able to meet, including emergency situations
ga: Is éard atá sa Scéim Liúntas Forlíontach Leasa Shóisialaigh buníocaíocht, ar a dtugtar Liúntas Leasa Forlíontach, agus fordheontais airgid eile le haghaidh costas eile ab fhéidir nach bhféadfaidh tú a ghlanadh, lena n-áirítear cásanna éigeandála

source: It is administered by the Department of Social Protection's representative (formerly known as the Community Welfare Officer) in your local office
ga: Ba cheart duit teagmháil a dhéanamh le hionadaí na Roinne Coimirce Sóisialaí (tugadh an tOifigeach Leasa Pobail orthu roimhe seo) ag d’ionad sláinte nó d’oifig DSP áitiúil

source: If you are in hospital for a temporary stay and do not qualify for any other payment, you may be paid a small amount for your daily personal needs (for example, newspapers and toiletries)
ga: Íocaíocht sheachtainiúil é an Liúntas Leasa Forlíontach a dhéantar le daoine nach bhfuil a ndóthain acmhainní acu nó atá gan ioncam

source: This payment (known as Hospital Comforts) is paid as a basic SWA payment and is means tested)
ga: Mar shampla, is féidir LLF a íoc leat le linn don Roinn a bheith ag próiseáil an éilimh a rinne tú ar íocaíocht eile

source: Rent Supplement is a payment to help with the cost of rent for people living in privately rented accommodation
ga: Is éard atá san Fhorlíonadh Cíosa íocaíocht a dhéantar le cabhrú le daoine atá ina gcónaí i gcóiríocht phríobháideach ar cíos costas an chíosa sin a ghlanadh

source: Mortgage Interest Supplement is a payment to help with the cost of mortgage interest repayments. From 1 January 2014, the Mortgage Interest Supplement scheme is closed to new entrants and no new applications will be accepted from this date
ga: Is éard atá san Fordheontas Úis Mhorgáiste íocaíocht a dhéantar le cabhrú le daoine costas aisíocaíochtaí úis mhorgáiste a ghlanadh

source: Back to School Clothing and Footwear Allowance is a payment to help with the cost of uniforms and footwear for children at school
ga: Is éard atá sa Liúntas Éadaí agus Coisbhirt don Scoilbhliain Nua íocaíocht a dhéantar le cabhrú le daoine costas na héide scoile agus an choisbhirt do leanaí atá ar scoil a ghlanadh

source: Diet Supplement is a payment to help with the cost of a special diet prescribed by your doctor or hospital consultant (it is no longer paid to new customers)
ga: Is éard atá san Fhordheontas Aiste Bia íocaíocht a dhéantar le cabhrú leat costas sainaiste bia a d’ordaigh an dóchtúir nó an comhairleach ospidéil duit a ghlanadh

source: Heating Supplement is a payment to help people who have extra heating needs with the cost of heating their home
ga: Is éard atá san Fordheontas Téimh íocaíocht a dhéantar le cabhrú le daoine ag a bhfuil riachtanais bhreise maidir le téamh costas téimh an tí a ghlanadh

source: For example, people that are ill or have a disability
ga: Mar shampla, daoine atá tinn nó faoi mhíchumas

source: Exceptional Needs Payment is a single payment to help meet essential, once-off, exceptional expenditure, which a person could not reasonably be expected to meet out of their weekly income
ga: Is éard atá san Íocaíocht Riachtanas Eisceachtúil íocaíocht aon uaire amháin le cabhrú le daoine i gcás caiteachais eisceachtúil aon uaire nach bhféadfaí a cheapadh go réasúnta go bhféadfaidís é a ghlanadh as a n-ioncam seachtainiúil

source: For example, the payments can be for special clothing for a person who has a serious illness, bedding or cooking utensils for someone setting up a home for the first time or costs in relation to funerals
ga: Mar shampla, d’fhéadfaí íocaíochtaí a dhéanamh le haghaidh éadaí speisialta do dhuine ar a mbeadh galar trom, nó le haghaidh leapacha nó gréithe cócaireachta do dhuine atá ag dul i mbun a thí féin den chéad uair, ag tabhairt cuairte ar ghaolta atá san ospidéal nó i bpríosún nó le haghaidh costas sochraide

source: Urgent Needs Payment is a payment to people in emergency situations
ga: Is éard atá san Íocaíocht Riachtanas Éigeandála íocaíocht a dhéantar le duine atá i gcás éigeandála

source: For example, in the case of a fire or flood, you may get a payment to help with the immediate cost of food and clothing
ga: Mar shampla, i gcás dóiteáin nó tuile, b’fhéidir go bhfaighidh tú íocaíocht le cabhrú leat costas láithreach bia agus éadaí a ghlanadh

source: If you are unhappy with the decision of a Department’s representative on your SWA application, you can appeal the decision to the independent Social Welfare Appeals Office
ga: Mura bhfuil tú sásta leis an toradh d'achomhairc Feidhmeannachta na Seirbhíse Sláinte, is féidir leat achomharc ar an Oifig Achomharc Leasa Shóisialaigh neamhspleách a dhéanamh

source: The Social Welfare Appeals Office deals with appeals relating to basic SWA and some SWA supplements but does not decide on appeals relating to Exceptional or Urgent Needs Payments or Heating Supplements
ga: Bíonn an Oifig Achomharc Leasa Shóisialaigh ag déileáil le hachomhairc faoi LLF bunúsach agus forlíonta LLF

source: You can ask for decisions on these payments to be reviewed by the SWA Reviewing Officer within the Community Welfare Service
ga: Áfach ní dhéanann an Oifig cinntí maidir le hÍocaíochtaí Riachtanais Eisceachtúil nó Práinneach
